Repository: balkin/telegram_post
Catalog: telegram_post.*.po
Languages: ru

source: Post to Telegram
ru: Отправить в Telegram

source: Announce this post to Telegram.
ru: Отправить уведомление об этом посте в Telegram.

source: API Key or Channel were not specified.
ru: Не указан ключ API или канал для отправки сообщений.

source: This text will be used as a template for posting to Telegram. Following token replacements are available: @url, @url-alias and @title
ru: Этот текст будет использован в качестве шаблона при отправке в Телеграм. Поддерживаются следующие переменные: @url, @url-alias и @title

source: Bot apikey:
ru: API ключ для бота

source: Telegram bot API key.
ru: Ключ API для бота.

source: Channel name:
ru: Имя канала:

source: Telegram channel name. Example: <u>@channel</u>
ru: Имя канала в Telegram. Например: <u>@channel</u>

source: Post to Telegram by default
ru: По умолчанию отправлять сообщение в Telegram

source: When active, automatically post to Telegram when the node is first published.
ru: Когда выбрано, автоматически сообщать в телеграм о первой публикации записи.

source: Also post to Telegram on update
ru: Также отправлять сообщение в Telegram при обновлении

source: Also announces to Telegram when the node is updated. May cause duplicate posts.
ru: Также сообщать в Telegram об измененияях записей. Может отправлять дублированные записи.

source: Default format string
ru: Формат строки по умолчанию

source: Please provide a valid channel name. Example: <u>@channel</u>
ru: Пожалуйста, укажите верное Имя канала в Telegram. Например: <u>@channel</u>

source: Telegram post config
ru: Настройка отправки сообщений в Telegram

source: Send message to telegram channel
ru: Отправить сообщение в канал в Telegram

source: Administer telegram item
ru: Администрировать Telegram item

source: Access permission to telegram post
ru: Разрешён доступ к отправке в Telegram

source: Telegram send message
ru: Отправка сообщений в Telegram

source: Allow user to publish updates using Telegram.
ru: Разрешает пользователю публиковать уведомления в Telegram.

source: Telegram Post
ru: Отправка в Telegram

source: Announce posts to Telegram
ru: Анонс записей в Telegram
